# Task 18
# X = брой шестици при 10 хвърляния на зара
# X ~ Bi(n=10, p=1/6)
 
# P(X=2)
dbinom(2,10,1/6)
 
# P(X<=2)
pbinom(2,10,1/6)
 
# P(X>=2) = 1 - P(X<=1)
1-pbinom(1,10,1/6)
 
# P(3 <= X <= 8) = P(X<=8) - p(X<=2)
pbinom(8,10,1/6) - pbinom(2,10,1/6)
sum(dbinom(3:8,10,1/6))
 
# Task 19
# X = брой хвърляния до падане на шестица
# X ~ Ge(p=1/6)
 
# P(X<=10)
pgeom(10-1,1/6)
 
# P(X>=6) = 1 - P(X<=5)
1-pgeom(5-1,1/6)
 
# Task 20
# X = брой хвърляния до падане на общо 3 шестици
# X ~ NB(r=3,p=1/6)
 
# P(X<=20)
pnbinom(20-3,3,1/6)
 
# Task 21
# X = брой нови батерии от избраните
# X ~ HypGe
 
# P(X<=1) = P(X=0) + P (X=1)
dhyper(0,5,3,2) + dhyper(1,5,3,2)


# Task 22
pbinom(2, 1500, 1/500) # or ppois(2, 1500*1/500)
pbinom(3, 1500, 1/500) - dbinom(0, 1500, 1/500) # or ppois(3, 1500*1/500) - dpois(0, 1500*1/500)

# Task 23
1 - pbinom(4, 10, 1/4)

# Task 24
pbinom(138, 143, 0.92)
dbinom(137, 143, 0.92)

# Task 25
pgeom(10-1, 0.03)
1 - pbinom(1, 50, 0.03)

# Task 26
1 - phyper(1, 3, 97, 50)

# Task 27
1 - phyper(1, 90, 2910, 50)

# Task 28
1 - pgeom(4-1, 1/10)
1 - dnbinom(50-10, 10, 1/10)

# Task 29
1 - pbinom(2, 360, 1/90)

# Task 30
1 - phyper(1, 13, 39, 10)

# Task 31
1 - pbinom(1, 10, 13/52)